project-chip/connectedhomeip/examples/platform/stm32/STM32WB5MM-DK/Src/stm32wb5mm_dk_qspi.c
/*
 *
 *    Copyright (c) 2026 Project CHIP Authors
 *    All rights reserved.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

#include "stm32wb5mm_dk_qspi.h"

/** @addtogroup STM32WB5MM_DK
 * @{
 */

/** @defgroup STM32WB5MM_DK_QSPI STM32WB5MM_DK QSPI
 * @{
 */

/** @defgroup STM32WB5MM_DK_QSPI_Exported_Variables Exported Variables
 * @{
 */
QSPI_HandleTypeDef hqspi;
BSP_QSPI_Ctx_t QSPI_Ctx[QSPI_INSTANCES_NUMBER];
/**
 * @}
 */

/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32WB5MM_DK_QSPI_Private_Functions Private Functions
 * @{
 */
static void QSPI_MspInit(QSPI_HandleTypeDef * hQspi);
static void QSPI_MspDeInit(QSPI_HandleTypeDef * hSspi);
static int32_t QSPI_ResetMemory(uint32_t Instance);
static int32_t QSPI_DummyCyclesCfg(uint32_t Instance);

/**
 * @}
 */

/** @defgroup STM32WB5MM_DK_QSPI_Exported_Functions Exported Functions
 * @{
 */

/**
 * @brief  Initializes the QSPI interface.
 * @param  Instance   QSPI Instance
 * @param  Init QSPI  Init structure
 * @retval BSP status
 */
int32_t BSP_QSPI_Init(uint32_t Instance, BSP_QSPI_Init_t * Init)
{
    int32_t ret = BSP_ERROR_NONE;
    BSP_QSPI_Info_t pInfo;
    MX_QSPI_Init_t qspi_init;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Check if instance is already initialized */
        if (QSPI_Ctx[Instance].IsInitialized == QSPI_ACCESS_NONE)
        {
#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 1)
            /* Register the QSPI MSP Callbacks */
            if (QSPI_Ctx[Instance].IsMspCallbacksValid == 0UL)
            {
                if (BSP_QSPI_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
                {
                    ret = BSP_ERROR_PERIPH_FAILURE;
                }
            }
#else
            /* Msp QSPI initialization */
            QSPI_MspInit(&hqspi);
#endif /* USE_HAL_QSPI_REGISTER_CALLBACKS == 1 */

            if (ret == BSP_ERROR_NONE)
            {
                /* STM32 QSPI interface initialization */
                (void) S25FL128S_GetFlashInfo(&pInfo);
                qspi_init.ClockPrescaler = 4;
                qspi_init.DualFlashMode  = S25FL128S_DUALFLASH_DISABLE;
                qspi_init.FlashSize      = (uint32_t) POSITION_VAL((uint32_t) pInfo.FlashSize) - 1U;
                qspi_init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;

                if (MX_QSPI_Init(&hqspi, &qspi_init) != HAL_OK)
                {
                    ret = BSP_ERROR_PERIPH_FAILURE;
                } /* QSPI memory reset */
                else if (QSPI_ResetMemory(Instance) != BSP_ERROR_NONE)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                } /* Force Flash enter 4 Byte address mode */
                else if (S25FL128S_AutoPollingMemReady(&hqspi, Init->InterfaceMode) != S25FL128S_OK)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                }
                else if (S25FL128S_Enter4BytesAddressMode(&hqspi, Init->InterfaceMode) != S25FL128S_OK)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                } /* Configuration of the dummy cycles on QSPI memory side */
                else if (QSPI_DummyCyclesCfg(Instance) != BSP_ERROR_NONE)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                }
                else
                {
                    QSPI_Ctx[Instance].InterfaceMode = Init->InterfaceMode;
                }
            }
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  De-Initializes the QSPI interface.
 * @param  Instance   QSPI Instance
 * @retval BSP status
 */
int32_t BSP_QSPI_DeInit(uint32_t Instance)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (QSPI_Ctx[Instance].IsInitialized == QSPI_ACCESS_MMP)
        {
            if (BSP_QSPI_DisableMemoryMappedMode(Instance) != BSP_ERROR_NONE)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
        }

        if (ret == BSP_ERROR_NONE)
        {
            /* Set default QSPI_Ctx values */
            QSPI_Ctx[Instance].IsInitialized = QSPI_ACCESS_NONE;
            QSPI_Ctx[Instance].InterfaceMode = BSP_QSPI_SPI_MODE;
            QSPI_Ctx[Instance].TransferRate  = BSP_QSPI_STR_TRANSFER;
            QSPI_Ctx[Instance].DualFlashMode = 0;

#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 0)
            QSPI_MspDeInit(&hqspi);
#endif /* (USE_HAL_QSPI_REGISTER_CALLBACKS == 0) */

            /* Call the DeInit function to reset the driver */
            if (HAL_QSPI_DeInit(&hqspi) != HAL_OK)
            {
                ret = BSP_ERROR_PERIPH_FAILURE;
            }
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Initializes the QSPI interface.
 * @param  hQspi       QSPI handle
 * @param  Config      QSPI configuration structure
 * @retval BSP status
 */
__weak HAL_StatusTypeDef MX_QSPI_Init(QSPI_HandleTypeDef * hQspi, MX_QSPI_Init_t * Config)
{
    /* QSPI initialization */
    /* QSPI freq = SYSCLK /(1 + ClockPrescaler) Mhz */
    hQspi->Instance                = QUADSPI;
    hQspi->Init.ClockPrescaler     = Config->ClockPrescaler;
    hQspi->Init.FifoThreshold      = 1;
    hQspi->Init.SampleShifting     = Config->SampleShifting;
    hQspi->Init.FlashSize          = Config->FlashSize;
    hQspi->Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_8_CYCLE;
    hQspi->Init.ClockMode          = QSPI_CLOCK_MODE_0;

    return HAL_QSPI_Init(hQspi);
}

#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 1)
/**
 * @brief Default BSP QSPI Msp Callbacks
 * @param Instance      QSPI Instance
 * @retval BSP status
 */
int32_t BSP_QSPI_RegisterDefaultMspCallbacks(uint32_t Instance)
{
    int32_t ret = BSP_ERROR_NONE;

