project-chip/connectedhomeip/examples/platform/stm32/STM32WB5MM-DK/Src/stm32wb5mm_dk_qspi.c
    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Register MspInit/MspDeInit Callbacks */
        if (HAL_QSPI_RegisterCallback(&hqspi, HAL_QSPI_MSPINIT_CB_ID, QSPI_MspInit) != HAL_OK)
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else if (HAL_QSPI_RegisterCallback(&hqspi, HAL_QSPI_MSPDEINIT_CB_ID, QSPI_MspDeInit) != HAL_OK)
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else
        {
            QSPI_Ctx[Instance].IsMspCallbacksValid = 1U;
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief BSP QSPI Msp Callback registering
 * @param Instance   QSPI Instance
 * @param CallBacks  pointer to MspInit/MspDeInit callbacks functions
 * @retval BSP status
 */
int32_t BSP_QSPI_RegisterMspCallbacks(uint32_t Instance, BSP_QSPI_Cb_t * CallBacks)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Register MspInit/MspDeInit Callbacks */
        if (HAL_QSPI_RegisterCallback(&hqspi, HAL_QSPI_MSPINIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else if (HAL_QSPI_RegisterCallback(&hqspi, HAL_QSPI_MSPDEINIT_CB_ID, CallBacks->pMspDeInitCb) != HAL_OK)
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else
        {
            QSPI_Ctx[Instance].IsMspCallbacksValid = 1U;
        }
    }

    /* Return BSP status */
    return ret;
}
#endif /* (USE_HAL_QSPI_REGISTER_CALLBACKS == 1) */

/**
 * @brief  Reads an amount of data from the QSPI memory.
 * @param  Instance  QSPI instance
 * @param  pData     Pointer to data to be read
 * @param  ReadAddr  Read start address
 * @param  Size      Size of data to read
 * @retval BSP status
 */
int32_t BSP_QSPI_Read(uint32_t Instance, uint8_t * pData, uint32_t ReadAddr, uint32_t Size)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (QSPI_Ctx[Instance].TransferRate == BSP_QSPI_STR_TRANSFER)
        {
            if (S25FL128S_ReadSTR(&hqspi, QSPI_Ctx[Instance].InterfaceMode, pData, ReadAddr, Size) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Writes an amount of data to the QSPI memory.
 * @param  Instance   QSPI instance
 * @param  pData      Pointer to data to be written
 * @param  WriteAddr  Write start address
 * @param  Size       Size of data to write
 * @retval BSP status
 */
int32_t BSP_QSPI_Write(uint32_t Instance, uint8_t * pData, uint32_t WriteAddr, uint32_t Size)
{
    int32_t ret = BSP_ERROR_NONE;
    uint32_t end_addr, current_size, current_addr;
    uint8_t * write_data;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Calculation of the size between the write address and the end of the page */
        current_size = S25FL128S_PAGE_SIZE - (WriteAddr % S25FL128S_PAGE_SIZE);

        /* Check if the size of the data is less than the remaining place in the page */
        if (current_size > Size)
        {
            current_size = Size;
        }

        /* Initialize the address variables */
        current_addr = WriteAddr;
        end_addr     = WriteAddr + Size;
        write_data   = pData;

        /* Perform the write page by page */
        do
        {
            /* Check if Flash busy ? */
            if (S25FL128S_AutoPollingMemReady(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            } /* Enable write operations */
            else if (S25FL128S_WriteEnable(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            } /* Issue page program command */
            else if (S25FL128S_PageProgram(&hqspi, QSPI_Ctx[Instance].InterfaceMode, write_data, current_addr, current_size) !=
                     S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            } /* Configure automatic polling mode to wait for end of program */
            else if (S25FL128S_AutoPollingMemReady(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
                /* Update the address and size variables for next page programming */
                current_addr += current_size;
                write_data += current_size;
                current_size = ((current_addr + S25FL128S_PAGE_SIZE) > end_addr) ? (end_addr - current_addr) : S25FL128S_PAGE_SIZE;
            }
        } while ((current_addr < end_addr) && (ret == BSP_ERROR_NONE));
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Erases the specified block of the QSPI memory.
 *         S25FL128S support 4K, 64K size block erase commands.
 * @param  Instance     QSPI instance
 * @param  BlockAddress Block address to erase
 * @param  BlockSize    Erase Block size
 * @retval BSP status
 */
int32_t BSP_QSPI_EraseBlock(uint32_t Instance, uint32_t BlockAddress, BSP_QSPI_Erase_t BlockSize)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Check Flash busy ? */
        if (S25FL128S_AutoPollingMemReady(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        } /* Enable write operations */
        else if (S25FL128S_WriteEnable(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            /* Issue Block Erase command */
            if (S25FL128S_BlockErase(&hqspi, QSPI_Ctx[Instance].InterfaceMode, BlockAddress, BlockSize) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            if (S25FL128S_AutoPollingMemReady(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Erases the entire QSPI memory.
 * @param  Instance  QSPI instance
 * @retval BSP status
 */
int32_t BSP_QSPI_EraseChip(uint32_t Instance)
{
    int32_t ret = BSP_ERROR_NONE;

