project-chip/connectedhomeip/examples/platform/stm32/STM32WB5MM-DK/Src/stm32wb5mm_dk_qspi.c
    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Check Flash busy ? */
        if (S25FL128S_AutoPollingMemReady(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        } /* Enable write operations */
        else if (S25FL128S_WriteEnable(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            /* Issue Chip erase command */
            if (S25FL128S_ChipErase(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Reads current status of the QSPI memory.
 *         If WIP != 0 then return busy.
 * @param  Instance  QSPI instance
 * @retval QSPI memory status: whether busy or not
 */
int32_t BSP_QSPI_GetStatus(uint32_t Instance)
{
    int32_t ret = BSP_ERROR_NONE;
    uint8_t reg;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (S25FL128S_ReadStatusRegister(&hqspi, QSPI_Ctx[Instance].InterfaceMode, &reg) != S25FL128S_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            /* Check the value of the register */
            if ((reg & S25FL128S_SR1_WIP) != 0U)
            {
                ret = BSP_ERROR_BUSY;
            }
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Return the configuration of the QSPI memory.
 * @param  Instance  QSPI instance
 * @param  pInfo     pointer on the configuration structure
 * @retval BSP status
 */
int32_t BSP_QSPI_GetInfo(uint32_t Instance, BSP_QSPI_Info_t * pInfo)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        (void) S25FL128S_GetFlashInfo(pInfo);
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Configure the QSPI in memory-mapped mode
 *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
 * @param  Instance  QSPI instance
 * @retval BSP status
 */
int32_t BSP_QSPI_EnableMemoryMappedMode(uint32_t Instance)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (QSPI_Ctx[Instance].TransferRate == BSP_QSPI_STR_TRANSFER)
        {
            if (S25FL128S_EnableMemoryMappedModeSTR(&hqspi, QSPI_Ctx[Instance].InterfaceMode) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else /* Update QSPI context if all operations are well done */
            {
                QSPI_Ctx[Instance].IsInitialized = QSPI_ACCESS_MMP;
            }
        }
        else
        {
            /* Update QSPI context if all operations are well done */
            QSPI_Ctx[Instance].IsInitialized = QSPI_ACCESS_MMP;
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @brief  Exit form memory-mapped mode
 *         Only 1 Instance can run MMP mode. And it will lock system at this mode.
 * @param  Instance  QSPI instance
 * @retval BSP status
 */
int32_t BSP_QSPI_DisableMemoryMappedMode(uint32_t Instance)
{
    uint8_t Dummy;
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (QSPI_Ctx[Instance].IsInitialized != QSPI_ACCESS_MMP)
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        } /* Abort MMP back to indirect mode */
        else if (HAL_QSPI_Abort(&hqspi) != HAL_OK)
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else
        {
            /* Force QSPI interface Sampling Shift to half cycle */
            hqspi.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;

            if (HAL_QSPI_Init(&hqspi) != HAL_OK)
            {
                ret = BSP_ERROR_PERIPH_FAILURE;
            }
            /* Dummy read for exit from Performance Enhance mode */
            else if (S25FL128S_ReadSTR(&hqspi, QSPI_Ctx[Instance].InterfaceMode, &Dummy, 0, 1) != S25FL128S_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else /* Update QSPI context if all operations are well done */
            {
                QSPI_Ctx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;
            }
        }
    }
    /* Return BSP status */
    return ret;
}

/**
 * @brief  Get flash ID, 3 Bytes
 *         Manufacturer ID, Memory type, Memory density
 * @param  Instance  QSPI instance
 * @param  Id QSPI Identifier
 * @retval BSP status
 */
int32_t BSP_QSPI_ReadID(uint32_t Instance, uint8_t * Id)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if the instance is supported */
    if (Instance >= QSPI_INSTANCES_NUMBER)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (S25FL128S_ReadID(&hqspi, QSPI_Ctx[Instance].InterfaceMode, Id) != S25FL128S_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
    }

    /* Return BSP status */
    return ret;
}

/**
 * @}
 */

/** @defgroup STM32WB5MM_DK_QSPI_Private_Functions Private Functions
 * @{
 */

/**
 * @brief QSPI MSP Initialization
 * @param hQspi : QSPI handle
 *        This function configures the hardware resources used in this example:
 *           - Peripheral's clock enable
 *           - Peripheral's GPIO Configuration
 *           - NVIC configuration for QSPI interrupt
 * @retval None
 */
static void QSPI_MspInit(QSPI_HandleTypeDef * hQspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hQspi);
    GPIO_InitTypeDef gpio_init_structure;

    /*##-1- Enable peripherals and GPIO Clocks #################################*/
    /* Enable the QuadSPI memory interface clock */
    QSPI_CLK_ENABLE();
    /* Reset the QuadSPI memory interface */
    QSPI_FORCE_RESET();
    QSPI_RELEASE_RESET();
    /* Enable GPIO clocks */
    QSPI_CS_GPIO_CLK_ENABLE();
    QSPI_CLK_GPIO_CLK_ENABLE();
    QSPI_D0_GPIO_CLK_ENABLE();
    QSPI_D1_GPIO_CLK_ENABLE();
    QSPI_D2_GPIO_CLK_ENABLE();
    QSPI_D3_GPIO_CLK_ENABLE();

